app/views/events/_form.html.haml

SELECT "facilities".* FROM "facilities"
---
      .controls
        = f.collection_select(:facility_ids, Facility.all, :id, :name,
          { prompt: "Please select your desired facilities" },
          { class: 'selectable-facility', :multiple => true })

SELECT "resources".* FROM "resources"
---
      .controls
        = f.collection_select(:resource_ids, Resource.all, :id, :name,
          { prompt: "Please select your desired resources" },
          { class: 'selectable-resource', :multiple => true })