app/views/events/index.html.haml

        %td= event.ending
        %td= link_to event.creator_name, user_path(User.find_by(name: event.creator_name))
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "Admin"]]

        %td
          - event.resources.collect do |r|
---
SELECT "resources".* FROM "resources" INNER JOIN "events_resources" ON "resources"."id" = "events_resources"."resource_id" WHERE "events_resources"."event_id" = $1  [["event_id", 2]]