app/views/events/show.html.haml

  %br
  = link_to @event.creator_name, user_path(User.find_by(name: @event.creator_name))

- if @event.facilities_list.present?
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "Admin"]]
SELECT "facilities".* FROM "facilities" INNER JOIN "events_facilities" ON "facilities"."id" = "events_facilities"."facility_id" WHERE "events_facilities"."event_id" = $1  [["event_id", 1]]


- if @event.resources_list.present?
---
SELECT "resources".* FROM "resources" INNER JOIN "events_resources" ON "resources"."id" = "events_resources"."resource_id" WHERE "events_resources"."event_id" = $1  [["event_id", 1]]