app/views/master_page/new.html.haml

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "Admin"]]
---
              %td= event.ending
              %td= link_to event.creator_name, user_path(User.find_by(name: event.creator_name))

SELECT "resources".* FROM "resources" INNER JOIN "events_resources" ON "resources"."id" = "events_resources"."resource_id" WHERE "events_resources"."event_id" = $1  [["event_id", 1]]
---

  - if @events.any?{ |e| !e.resources_checked_in? && e.ending < Time.zone.now }