app/views/searches/show.html.haml

SELECT "facilities".* FROM "facilities"
---
		- @search.facilities_results
		- @search.facilities_results.each do |facility|

SELECT "resources".* FROM "resources"
---
		- @search.resources_results
		- @search.resources_results.each do |resource|