app/controllers/events_controller.rb

  def create
    @event = @scope.new(event_params)
    if !@event.capacity_check || !@event.facility_priority_check || !@event.recurring_check || !@event.schedule_time_check
      @event.approved = false
    end
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("recurrence", "resource_counts", "title", "description", "memo", "start", "ending", "user_id", "attendees", "approved", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "recurrence" = $1, "resource_counts" = $2, "approved" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["recurrence", nil], ["resource_counts", nil], ["approved", "t"], ["updated_at", "2015-04-28 15:07:03.284057"], ["id", 2]]

  def destroy
    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]

  def approve
    set_event
    @event.approved = true;
    @event.save!
---
UPDATE "events" SET "recurrence" = $1, "resource_counts" = $2, "approved" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["recurrence", nil], ["resource_counts", nil], ["approved", "t"], ["updated_at", "2015-04-28 16:49:09.740484"], ["id", 3]]

  def check_in
    set_event
    @event.checked_in = true;
    @event.save!
---
UPDATE "events" SET "recurrence" = $1, "checked_in" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["recurrence", nil], ["checked_in", "t"], ["updated_at", "2015-04-26 04:42:26.650552"], ["id", 2]]