app/controllers/facilities_controller.rb

  def index
    @facilities = Facility.all
---
SELECT "facilities".* FROM "facilities"

  def update
    respond_to do |format|
      if @facility.update(facility_params)
---
UPDATE "facilities" SET "capacity" = $1, "priority" = $2, "min_capacity" = $3, "has_tv" = $4, "has_proj" = $5, "has_tables" = $6, "updated_at" = $7 WHERE "facilities"."id" = $8  [["capacity", 60], ["priority", "f"], ["min_capacity", 20], ["has_tv", "f"], ["has_proj", "f"], ["has_tables", "f"], ["updated_at", "2015-04-27 00:37:40.960680"], ["id", 1]]

    def set_facility
      @facility = Facility.find(params[:id])
---
SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = $1 LIMIT 1  [["id", 1]]