app/controllers/master_page_controller.rb

SELECT "users".* FROM "users"
SELECT "events".* FROM "events"
---
  def new
    @users = User.all
    @events = Event.all