app/controllers/searches_controller.rb

INSERT INTO "searches" ("start_date", "start", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["start_date", "2015-04-25"], ["start", "2015-04-24 15:15:00.000000"], ["created_at", "2015-04-24 19:24:31.561007"], ["updated_at", "2015-04-24 19:24:31.561007"]]
---
	def create
		@search = Search.create!(params[:search])

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@search = Search.find(params[:id])