app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "phone", "home_group", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(update_user_params)
---
UPDATE "users" SET "home_group" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["home_group", "abc"], ["updated_at", "2015-04-25 05:29:08.070194"], ["id", 2]]

  def update_password
    @user = User.find_by(email: params[:email])
    respond_to do |format|
      if @user.update(password_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "dc@email.com"]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$hrB.n1ibV1AsFF8PVVGA0eEMOHTGxMNULQu8/1hyX9reCZmVNDNru"], ["updated_at", "2015-04-25 05:14:24.455356"], ["id", 2]]

  def activate
    set_user
    @user.activated = true;
    @user.save!
---
UPDATE "users" SET "activated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["activated", "t"], ["updated_at", "2015-04-25 05:09:54.328300"], ["id", 2]]